app/Controllers/Dosen/Nilai.php

SELECT `jadwal`.*, `mata_kuliah`.`nama_mata_kuliah`, `ruangan`.`nama_ruangan`
FROM `jadwal`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
LEFT JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
WHERE `jadwal`.`nidn` = 'D001'
---
    public function index()
    {
        $nidn = session()->get('kode_peran');

        $data['jadwal'] = $this->jadwalModel
            ->select('jadwal.*, mata_kuliah.nama_mata_kuliah, ruangan.nama_ruangan')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah', 'left')
            ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan', 'left')
            ->where('jadwal.nidn', $nidn)
            ->findAll();

SELECT `jadwal`.*, `mata_kuliah`.`nama_mata_kuliah`
FROM `jadwal`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
WHERE `jadwal`.`id` = '15'
SELECT `rencana_studi`.*, `mahasiswa`.`nama`, `mahasiswa`.`nim`
FROM `rencana_studi`
LEFT JOIN `mahasiswa` ON `mahasiswa`.`nim` = `rencana_studi`.`nim`
WHERE `rencana_studi`.`id_jadwal` = '15'
SELECT *
FROM `nilai_mutu`
---
    public function daftar($id_jadwal)
    {
        $data['jadwal'] = $this->jadwalModel
            ->select('jadwal.*, mata_kuliah.nama_mata_kuliah')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah', 'left')
            ->find($id_jadwal);

        $data['mahasiswa'] = $this->rencanaModel
            ->select('rencana_studi.*, mahasiswa.nama, mahasiswa.nim')
            ->join('mahasiswa', 'mahasiswa.nim = rencana_studi.nim', 'left')
            ->where('rencana_studi.id_jadwal', $id_jadwal)
            ->findAll();

        $data['nilaiMutu'] = $this->nilaiMutuModel->findAll();