app/Controllers/AuthController.php

    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();

        if (!$user) {
            return redirect()->back()->with('error', 'Username tidak ditemukan.');
        }

        // cek password (bcrypt atau md5)
        if (password_verify($password, $user['password']) || md5($password) === $user['password']) {

            // jika role mahasiswa, coba ambil nim dari tabel mahasiswa berdasarkan kode_peran
            $nim = null;
            if ($user['role'] === 'mahasiswa') {
                $db = \Config\Database::connect();
                $mahasiswa = $db->table('mahasiswa')
                    ->where('nim', $user['kode_peran'])
                    ->get()
                    ->getRow();
---
SELECT *
FROM `user`
WHERE `username` = 'rizal'
 LIMIT 1
SELECT *
FROM `mahasiswa`
WHERE `nim` = 'M001'