app/Controllers/Mahasiswa/HasilStudi.php

SELECT `rencana_studi`.*, `mata_kuliah`.`nama_mata_kuliah`, `mata_kuliah`.`sks`, `dosen`.`nama` AS `nama_dosen`
FROM `rencana_studi`
LEFT JOIN `jadwal` ON `jadwal`.`id` = `rencana_studi`.`id_jadwal`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
LEFT JOIN `dosen` ON `dosen`.`nidn` = `jadwal`.`nidn`
WHERE `rencana_studi`.`nim` = 'M001'
SELECT *
FROM `nilai_mutu`
WHERE `nilai_huruf` = 'A'
 LIMIT 1
---
    public function index()
    {
        $nim = session()->get('kode_peran');

        // Ambil data hasil studi mahasiswa
        $hasilStudi = $this->rencanaModel
            ->select('rencana_studi.*, mata_kuliah.nama_mata_kuliah, mata_kuliah.sks, dosen.nama AS nama_dosen')
            ->join('jadwal', 'jadwal.id = rencana_studi.id_jadwal', 'left')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah', 'left')
            ->join('dosen', 'dosen.nidn = jadwal.nidn', 'left')
            ->where('rencana_studi.nim', $nim)
            ->findAll();

        $totalMutu = 0;
        $totalSks = 0;

        foreach ($hasilStudi as &$h) {
            if (!empty($h['nilai_huruf'])) {
                $nilaiMutu = $this->nilaiMutuModel
                    ->where('nilai_huruf', $h['nilai_huruf'])
                    ->first();