app/Controllers/Mahasiswa/RencanaStudi.php

    public function index()
    {
        $nim = session()->get('kode_peran'); // asumsi NIM disimpan di session saat login

        $data['jadwalTersedia'] = $this->jadwalModel
            ->select('jadwal.*, mata_kuliah.nama_mata_kuliah, dosen.nama AS nama_dosen, ruangan.nama_ruangan')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah', 'left')
            ->join('dosen', 'dosen.nidn = jadwal.nidn', 'left')
            ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan', 'left')
            ->findAll();

        $data['rencanaSaya'] = $this->rencanaModel
            ->select('rencana_studi.*, jadwal.nama_kelas, jadwal.hari, jadwal.jam,
                      mata_kuliah.nama_mata_kuliah, dosen.nama AS nama_dosen, ruangan.nama_ruangan')
            ->join('jadwal', 'jadwal.id = rencana_studi.id_jadwal', 'left')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah', 'left')
            ->join('dosen', 'dosen.nidn = jadwal.nidn', 'left')
            ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan', 'left')
            ->where('rencana_studi.nim', $nim)
            ->findAll();
---
SELECT `jadwal`.*, `mata_kuliah`.`nama_mata_kuliah`, `dosen`.`nama` AS `nama_dosen`, `ruangan`.`nama_ruangan`
FROM `jadwal`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
LEFT JOIN `dosen` ON `dosen`.`nidn` = `jadwal`.`nidn`
LEFT JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
SELECT `rencana_studi`.*, `jadwal`.`nama_kelas`, `jadwal`.`hari`, `jadwal`.`jam`, `mata_kuliah`.`nama_mata_kuliah`, `dosen`.`nama` AS `nama_dosen`, `ruangan`.`nama_ruangan`
FROM `rencana_studi`
LEFT JOIN `jadwal` ON `jadwal`.`id` = `rencana_studi`.`id_jadwal`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
LEFT JOIN `dosen` ON `dosen`.`nidn` = `jadwal`.`nidn`
LEFT JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
WHERE `rencana_studi`.`nim` = 'M001'

    public function store()
    {
        $nim = session()->get('kode_peran');
        $id_jadwal = $this->request->getPost('id_jadwal');

        if (!$nim || !$id_jadwal) {
            return redirect()->back()->with('error', 'Data tidak valid.');
        }

        // pastikan mahasiswa ada di tabel mahasiswa
        $mhs = $this->mahasiswaModel->where('nim', $nim)->first();
        if (!$mhs) {
            return redirect()->back()->with('error', 'Mahasiswa tidak ditemukan di database.');
        }

        // cek apakah jadwal ini sudah diambil
        $sudahAda = $this->rencanaModel
            ->where('nim', $nim)
            ->where('id_jadwal', $id_jadwal)
            ->first();

        if ($sudahAda) {
            return redirect()->back()->with('error', 'Jadwal ini sudah kamu ambil sebelumnya.');
        }

        // ambil data jadwal baru
        $jadwalBaru = $this->jadwalModel->find($id_jadwal);
---
SELECT *
FROM `mahasiswa`
WHERE `nim` = 'M001'
 LIMIT 1
SELECT *
FROM `jadwal`
WHERE `jadwal`.`id` = '15'

        [$baruMulai, $baruSelesai] = $this->pecahWaktu($jadwalBaruJam);

        // ambil semua jadwal mahasiswa untuk cek bentrok
        $rencanaSaya = $this->rencanaModel
            ->select('jadwal.hari, jadwal.jam')
            ->join('jadwal', 'jadwal.id = rencana_studi.id_jadwal', 'left')
            ->where('rencana_studi.nim', $nim)
            ->findAll();
---
SELECT `jadwal`.`hari`, `jadwal`.`jam`
FROM `rencana_studi`
LEFT JOIN `jadwal` ON `jadwal`.`id` = `rencana_studi`.`id_jadwal`
WHERE `rencana_studi`.`nim` = 'M001'